# Description:
#   呼びかけに「judge」「ジャッジ」「判定」「どう思」
#   という単語が含まれていたら、判定する

module.exports = (robot) ->

  robot.respond /.*judge|.*ジャッジ|.*判定|.*どう思/i, (msg) ->
    response = msg.random judge
    if Math.random() < 0.2
      response = msg.random(pre) + response

    if Math.random() < 0.25
      response += msg.random gobi

    msg.send response
    msg.finish()

judge = [
  "YES です", "NO です",
  "YES か NO かと言われたら YES", "YES か NO かと言われたら NO"

  "OK です", "NG です",
  "よいです", "ダメです"
  "よいと思います", "よくないと思います",
  "オッケーです", "ダメです", "いいんじゃないですかね", "やっぱりダメですね"
  "オッケ", "OK", "いいよー", "だめ", "だーめ", "だ〜め"
  "うんいいよ", "だめだよ", "問題ないよ", "やめた方がいいよ"

  "アリです", "全然アリ", "あると思います",
  "ナシです", "それは無い", "ないと思います"

  "セーフです", "アウトです", "ギリギリセーフ", "ギリギリアウト"

  "イケます", "それはいけません"
  "ありえません", "ありえます"

  "よい判断かと", "よい選択", "概ねオッケー"
  "まずいっすね", "間違った選択っすね", "全部ダメ"

  "賛成です", "反対です", "賛成っちゃ賛成", "反対っちゃ反対"
  "賛同しかねるわー", "反対とは言えないわー"

  "好き", "きらい", "ちょっと好き", "ちょっと嫌"
  "そういうの好き", "嫌いじゃないよ"

  "満場一致で可決", "もう一度考えよう", "フィフティ・フィフティ"
  "一番エラい人に聞いて", "あなたに決める権利があるよ"

  "わからん", "どちらかを選べる問題ではないです",
  "ちょっと考えさせてください", "難しい質問です"
]

pre = [
  "うんとね、", "うーん、", "あー…　", "えっとね、", "えっ、", "え、", "あ、"
]

gobi = [
  "w", "…", "☆", "☆"
  " ^_^", " >_<"
  " （逆に）", " （確信）", " （困惑）", " （嘘です）"
]
